In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import GridSearchCV
from sklearn import metrics

**Part 1.1 a - Read ‘Car name.csv’ as a DataFrame and assign it to a variable**

In [2]:
data1 = pd.read_csv("/workspaces/GreatLearning/Unsupervised/Project/Car name.csv")

In [3]:
data1.head()

                    car_name
0  chevrolet chevelle malibu
1          buick skylark 320
2         plymouth satellite
3              amc rebel sst
4                ford torino

In [10]:
data1.shape

(398, 1)

**Part 1.1 b - Read ‘Car-Attributes.json as a DataFrame and assign it to a variable.**

In [7]:
data2 = pd.read_json("/workspaces/GreatLearning/Unsupervised/Project/Car-Attributes.json")

In [8]:
data2.head()

    mpg  cyl   disp   hp    wt   acc  yr  origin
0  18.0    8  307.0  130  3504  12.0  70       1
1  15.0    8  350.0  165  3693  11.5  70       1
2  18.0    8  318.0  150  3436  11.0  70       1
3  16.0    8  304.0  150  3433  12.0  70       1
4  17.0    8  302.0  140  3449  10.5  70       1

In [11]:
data2.shape

(398, 8)

**Part 1.1 c - Merge both the DataFrames together to form a single DataFrame**

In [12]:
data = pd.merge(data1, data2, left_index=True, right_index=True)

In [13]:
data.head()

                    car_name   mpg  cyl   disp   hp    wt   acc  yr  origin
0  chevrolet chevelle malibu  18.0    8  307.0  130  3504  12.0  70       1
1          buick skylark 320  15.0    8  350.0  165  3693  11.5  70       1
2         plymouth satellite  18.0    8  318.0  150  3436  11.0  70       1
3              amc rebel sst  16.0    8  304.0  150  3433  12.0  70       1
4                ford torino  17.0    8  302.0  140  3449  10.5  70       1

In [14]:
data.shape

(398, 9)